# Anlysis of Uber trips in New York, 2014

In [6]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import folium as fl

In [136]:
uber_april = pd.read_csv('data/Uber-dataset/uber-raw-data-apr14.csv')
uber_april

                 Date/Time      Lat      Lon    Base
0         4/1/2014 0:11:00  40.7690 -73.9549  B02512
1         4/1/2014 0:17:00  40.7267 -74.0345  B02512
2         4/1/2014 0:21:00  40.7316 -73.9873  B02512
3         4/1/2014 0:28:00  40.7588 -73.9776  B02512
4         4/1/2014 0:33:00  40.7594 -73.9722  B02512
...                    ...      ...      ...     ...
564511  4/30/2014 23:22:00  40.7640 -73.9744  B02764
564512  4/30/2014 23:26:00  40.7629 -73.9672  B02764
564513  4/30/2014 23:31:00  40.7443 -73.9889  B02764
564514  4/30/2014 23:32:00  40.6756 -73.9405  B02764
564515  4/30/2014 23:48:00  40.6880 -73.9608  B02764

[564516 rows x 4 columns]

In [137]:
date_times = pd.to_datetime(uber_april['Date/Time'], format='%m/%d/%Y %H:%M:%S')

date = date_times.apply(lambda dt: dt.date())
date.name = 'Date'
time = date_times.apply(lambda dt: dt.time())
time.name = 'Time'

In [139]:
df = pd.concat([date, time, uber_april.drop(columns='Date/Time')], axis=1)
df.head()

         Date      Time      Lat      Lon    Base
0  2014-04-01  00:11:00  40.7690 -73.9549  B02512
1  2014-04-01  00:17:00  40.7267 -74.0345  B02512
2  2014-04-01  00:21:00  40.7316 -73.9873  B02512
3  2014-04-01  00:28:00  40.7588 -73.9776  B02512
4  2014-04-01  00:33:00  40.7594 -73.9722  B02512

In [140]:
df.isnull().any()

Date    False
Time    False
Lat     False
Lon     False
Base    False
dtype: bool